app/views/productos/_form.html.erb

  <div class="field">
    <%= f.collection_select :sustancium_id, Sustancium.all, :id, :descripcion, label: "Sustancia" %>
---
SELECT "sustancia".* FROM "sustancia"

  <div class="field">
    <%= f.collection_select :presentacion_id, Presentacion.all, :id, :descripcion, label: "Presentación" %>
---
SELECT "presentacions".* FROM "presentacions"

  <div class="field">
    <%= f.collection_select :laboratorio_id, Laboratorio.all, :id, :nombre %>
---
SELECT "laboratorios".* FROM "laboratorios"

  <div class="field" id="plan_paciente" style="display:none">
    <%= f.collection_select :plan_paciente_id, PlanPaciente.all, :id, :nombre, include_blank: true , label: "Plan Paciente"%>
---
SELECT "plan_pacientes".* FROM "plan_pacientes"