app/controllers/laboratorios_controller.rb

SELECT "laboratorios".* FROM "laboratorios"
---
  def index
     @laboratorios = Laboratorio.all

INSERT INTO "laboratorios" ("nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "fndjfj"], ["descripcion", "bjb"], ["created_at", "2017-05-25 03:57:37.977393"], ["updated_at", "2017-05-25 03:57:37.977393"]]
---
  def create
    @laboratorio = Laboratorio.new(laboratorio_params)

    respond_to do |format|
      if @laboratorio.save

UPDATE "laboratorios" SET "descripcion" = $1, "updated_at" = $2 WHERE "laboratorios"."id" = $3  [["descripcion", "buenso planes"], ["updated_at", "2017-05-26 00:16:31.973374"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @laboratorio.update(laboratorio_params)

DELETE FROM "laboratorios" WHERE "laboratorios"."id" = $1  [["id", 2]]
---
  def destroy

    @laboratorio.destroy

SELECT  "laboratorios".* FROM "laboratorios" WHERE "laboratorios"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_laboratorio
      @laboratorio = Laboratorio.find(params[:id])