app/controllers/plan_pacientes_controller.rb

  def index
    @plan_pacientes = PlanPaciente.paginate(:page => params[:page], :per_page => 8)
---
SELECT "plan_pacientes".* FROM "plan_pacientes"

  def show
       @tipo_plan = TipoPlan.new
       @plan_Paciente_Paciente = TipoPlan.where(["plan_paciente_id = ? and tipo = ?", params[:id], "Paciente"])
---
SELECT "tipo_plans".* FROM "tipo_plans" WHERE (plan_paciente_id = '20' and tipo = 'Paciente')

  def new
    @laboratorios = Laboratorio.all
---
SELECT "laboratorios".* FROM "laboratorios"

  def edit
    @laboratorios = Laboratorio.all
---
SELECT "laboratorios".* FROM "laboratorios"

  def create
    @plan_paciente = PlanPaciente.new(plan_paciente_params)

    respond_to do |format|
      if @plan_paciente.save
---
INSERT INTO "plan_pacientes" ("nombre", "laboratorio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "diego"], ["laboratorio_id", 0], ["created_at", "2017-05-26 02:22:13.352648"], ["updated_at", "2017-05-26 02:22:13.352648"]]

  def update
    respond_to do |format|
      if @plan_paciente.update(plan_paciente_params)
---
UPDATE "plan_pacientes" SET "nombre" = $1, "laboratorio_id" = $2, "updated_at" = $3 WHERE "plan_pacientes"."id" = $4  [["nombre", "bien"], ["laboratorio_id", 17], ["updated_at", "2017-05-26 04:02:37.717251"], ["id", 9]]

  def destroy
    @plan_paciente.destroy
---
DELETE FROM "plan_pacientes" WHERE "plan_pacientes"."id" = $1  [["id", 6]]

    def set_plan_paciente
      @plan_paciente = PlanPaciente.find(params[:id])
---
SELECT  "plan_pacientes".* FROM "plan_pacientes" WHERE "plan_pacientes"."id" = $1 LIMIT 1  [["id", 9]]