app/controllers/presentacions_controller.rb

  def index
    @presentacions = Presentacion.paginate(:page => params[:page], :per_page => 8)
---
SELECT "presentacions".* FROM "presentacions"

  def create
    @presentacion = Presentacion.new(presentacion_params)

    respond_to do |format|
      if @presentacion.save
---
INSERT INTO "presentacions" ("descripcion", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descripcion", "Jarabe"], ["created_at", "2017-05-29 00:09:58.773426"], ["updated_at", "2017-05-29 00:09:58.773426"]]

  def destroy
    @presentacion.destroy
---
DELETE FROM "presentacions" WHERE "presentacions"."id" = $1  [["id", 1]]

    def set_presentacion
      @presentacion = Presentacion.find(params[:id])
---
SELECT  "presentacions".* FROM "presentacions" WHERE "presentacions"."id" = $1 LIMIT 1  [["id", 1]]