app/controllers/productos_controller.rb

  def index
    @productos = Producto.paginate(:page => params[:page], :per_page => 8)
---
SELECT "productos".* FROM "productos"

  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("nombre", "sustancium_id", "presentacion_id", "oferta", "laboratorio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nombre", "ffff"], ["sustancium_id", 1], ["presentacion_id", 2], ["oferta", ""], ["laboratorio_id", 15], ["created_at", "2017-05-29 04:44:10.037902"], ["updated_at", "2017-05-29 04:44:10.037902"]]

  def update
    respond_to do |format|
      if @producto.update(producto_params)
---
UPDATE "productos" SET "plan_paciente_id" = $1, "updated_at" = $2 WHERE "productos"."id" = $3  [["plan_paciente_id", 20], ["updated_at", "2017-05-29 03:03:55.156458"], ["id", 18]]

  def destroy
    @producto.destroy
---
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 16]]

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT 1  [["id", 16]]