app/controllers/tipo_plans_controller.rb

SELECT "tipo_plans".* FROM "tipo_plans"
---
  def index
    @tipo_plans = TipoPlan.all

INSERT INTO "tipo_plans" ("tipo", "descripcion", "plan_paciente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tipo", "Paciente"], ["descripcion", "gghj"], ["plan_paciente_id", 20], ["created_at", "2017-05-27 03:53:29.487473"], ["updated_at", "2017-05-27 03:53:29.487473"]]
---
  def create
    @tipo_plan = TipoPlan.new(tipo_plan_params)

    respond_to do |format|
      if @tipo_plan.save

DELETE FROM "tipo_plans" WHERE "tipo_plans"."id" = $1  [["id", 1]]
---
  def destroy
    @tipo_plan.destroy

SELECT  "tipo_plans".* FROM "tipo_plans" WHERE "tipo_plans"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_tipo_plan
      @tipo_plan = TipoPlan.find(params[:id])